<?php

/* 
$i = 0;
A:
if ($i < 10) {
    echo $i;
    $i++
    goto A;
}
*/

// for ($i = 0; $i < 15; $i++) {
//     echo $i;
// }

/*Вывести все четные числа от 1 до 100 */

// $i = 1;
// A:
// if($i <= 100) {
//     if($i % 2 == 0) {
//         echo $i . " ";
//     }
//     $i++;
//     goto A;
// }

// for ($i = 1; $i <= 100; $i++) {
//     if($i % 2 == 0) {
//         echo $i . " ";
//     }
// }

/*Вывести на экран сумму всех четных чисел от 1 до 100 */
// $sum = 0;
// for ($i = 1; $i <= 100; $i++) {
//     if($i % 2 == 0) {
//         $sum = $sum + $i;
//     }
// }
// echo $sum;

// $a = rand(1, 70);
// echo $a;
// for ($i = $a; $i <= 100; $i++) {
//     if ($i % 2 == 1) {
//         echo $i . " ";
//     }
// }