<?php

// $arr = [88, 77, 99];
// echo $arr[1];
// echo $arr[2];
// $arr[3] = "LEXA";
// echo $arr[3];
// $arr[0] = 66;
// echo $arr[0];
// $arr[] = 55;
// echo $arr[4];
// $arr[100] = 19;
// $arr[44] = 91;
// $arr[] = 1000;
// $arr[] = [1, 2, "Zhuma loh", 4, 5];
// echo $arr[102][2];
// print_r($arr);

/*Собрать массив из 10 случайных чисел */

// $arr = [];
// for($i = 0; $i < 10; $i++) {
//     $arr[] = rand(0, 100);
// }
// print_r($arr);


/*Собрать массив таблицы умножения */

// $arr = [];
// for($i = 1; $i < 10; $i++) {
//     $arr[$i] = [];
//     for($j = 1; $j < 10; $j++) {
//         $arr[$i][$j] = $i*$j;
//     }
// }
// print_r($arr);
// echo $arr[7][8];

/*Написать программу,  подсчитывающую количество четных и нечетных чисел от 10 до 100 */
// $evenCount = 0;
// $oddCount = 0;

// $i = 10;
// A:
// if ($i <= 100) {
//     if ($i % 2 == 0) {
//         $evenCount++;
//     } else {
//         $oddCount++;
//     }
//     $i++;
//     goto A;
// }




// for ($i = 10; $i <= 100; $i++) {
// if ($i % 2 == 0) {
//     $evenCount++;
// } else {
//     $oddCount++;
// }
// }
// echo "Even counts :" . $evenCount . "<br>";
// echo "Odd counts :" . $oddCount . "<br>";


/*Дано случайное число. Найти сумму произведения его цифер. 
Ex: 457;  16 140
// */
// $s = 0;
// $m = 1; 
// $a = rand(1, 1000); 

// for ($i=$a; $i > 0; $i=$i/10) {
//     $k = $i%10;
//     $s = $s + $k;
//     $m = $m * $k;
//     $i = $i - $k;
// }

// echo $a . ' ' . $s . ' ' . $m;

/*Для каждого числа от 1 до 5 вывести все числа на которые оно делится в следующем виде:
1: 1
2: 1 2
3: 1 3
4: 1 2 4
5: 1 5
*/
$a=1;
A:
if($a<=10) {
    echo $a . ':  ';
    $i = 1;
    B:
    if($i<=$a) {
        if($a%$i == 0) {
            echo $i . ' ';
        }
        $i++;
        goto B;
    }
    echo '<br>';
    $a++;
    goto A;
}


// for ($a = 1; $a <= 10; $a++) {
//     echo $a . ':  ';
//     for ($i = 1; $i <= $a; $i++) {
//         if($a%$i == 0) {
//             echo $i . ' ';
//         }
//     }
//     echo '<br>';
// }

